Aniakea/frame/poc/apps/poc_a/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

CONFIG_COMPILER_OPTIMIZATION_DEBUG=y
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# T7 (.plugin_iram loader patch): dynamic executable-memory allocation
# (MALLOC_CAP_EXEC, the loader's esp_elf_malloc_iram) exists only with the
# IDF exec heap, which memory protection disables per its own Kconfig help
# ("allocating memory with MALLOC_CAP_EXEC capability is not possible when
# this config is enabled"). Software-only PMP config, no eFuse involved;
# reversed for the PoC harness because requirements 4.10.3/4.10.4 require
# plugin hot functions in IRAM.
CONFIG_ESP_SYSTEM_MEMPROT=n
